
[GraphicalObject]
Name=EEVtool
Path=
PosStyle=VARIABLE
RC-DLL=hpcor008.dll
Caption=编辑积分事件
x=0
y=0
Height=70
Width=265

[ToolDescriptor]
1=Check1Text, STATIC , HPGWCT02.DLL
2=Check1, IMAGESET , hpgbut02.DLL
3=Btn1 , PUSHBUTTON , hpgbut02.dll
4=Btn2 , PUSHBUTTON , hpgbut02.dll
5=Btn3 , PUSHBUTTON , hpgbut02.dll
6=Btn4 , PUSHBUTTON , hpgbut02.dll
7=Btn5 , PUSHBUTTON , hpgbut02.dll
8=Btn6 , PUSHBUTTON , hpgbut02.dll
9=Btn7 , PUSHBUTTON , hpgbut02.dll
10=Btn8 , PUSHBUTTON , hpgbut02.dll

[STATIC Check1Text]
Text1=手动积分事件
x=5
y=50
Height=15
Width=125
BKColor=192,192,192
Font=宋体,9,normal
Enable=1
Help=积分信号所包括的手动设置积分事件

[STATIC Check3Text]
Text1=基线优化处理
x=5
y=53
Height=15
Width=125
BKColor=192,192,192
Font=宋体,9,normal
Enable=1
Help=选择增强基线模式

[IMAGESET Check1]
Set0=RBMP.CHECKBOX_UNCHECKED|RBMP.CHECKBOX_UNCHECKED|RBMP.CHECKBOX_UNCHECKED|EEV_ToolOnControl 1|不包括手动事件|
Set1=RBMP.CHECKBOX_CHECKED|RBMP.CHECKBOX_CHECKED|RBMP.CHECKBOX_CHECKED|EEV_ToolOnControl 1|包含手动积分事件|
x=136
y=49
width=13
height=13
FrameThickness=0
Color=192,192,192
Enable=1
State=0
SetIndex=0

[IMAGESET Check3]
Set0=RBMP.CHECKBOX_UNCHECKED|RBMP.CHECKBOX_UNCHECKED|RBMP.CHECKBOX_UNCHECKED|EEV_ToolOnControl 11|关闭增强基线模式|
Set1=RBMP.CHECKBOX_CHECKED|RBMP.CHECKBOX_CHECKED|RBMP.CHECKBOX_CHECKED|EEV_ToolOnControl 11|启用增强型基线模式|
x=136
y=52
width=13
height=13
FrameThickness=0
Color=192,192,192
Enable=1
State=0
SetIndex=0

[NONEDITCOMBOBOX Check2]
DefCommand=EEV_ToolOnControl 2,
x=136
y=66
width=125
height=120
Enable=1
BkColor=255,255,255
Font=宋体,9,normal

[PushButton Btn1]
Command=EEV_ToolOnControl 4
ImageList=RBMP.EDITEVENTSSAVE20|RBMP.EDITEVENTSSAVE20|RBMP.EDITEVENTSSAVE_DISABLE20|
Help=退出并保存所有事件到方法中
x=5
y=5
width=26
height=26
Font=宋体,9,bold

[PushButton Btn2]
Command=EEV_ToolOnControl 7
ImageList=RBMP.EDITEVENTSEDITTAB20|RBMP.EDITEVENTSEDITTAB20|RBMP.EDITEVENTSEDITTAB_DISABLE20|
Help=从正在编辑的方法中选择一个事件表
x=31
y=5
width=26
height=26
Font=宋体,9,bold
Enable=1

[PushButton Btn3]
Command=EEV_ToolOnControl 5
ImageList=RBMP.EDITEVENTSCOPYTAB20|RBMP.EDITEVENTSCOPYTAB20|RBMP.EDITEVENTSCOPYTAB_DISABLE20|
Help=从方法中复制事件表并替换当前事件表
x=57
y=5
width=26
height=26
Font=宋体,9,bold

[PushButton Btn4]
Command=EEV_ToolOnControl 8
ImageList=RBMP.EDITEVENTSINSROW20|RBMP.EDITEVENTSINSROW20|RBMP.EDITEVENTSINSROW_DISABLE20|
Help=向事件表中添加一行
x=83
y=5
width=26
height=26
Font=宋体,9,bold

[PushButton Btn5]
Command=EEV_ToolOnControl 9
ImageList=RBMP.EDITEVENTSDELROW20|RBMP.EDITEVENTSDELROW20|RBMP.EDITEVENTSDELROW_DISABLE20|
Help=从事件表中删除选择的行
x=109
y=5
width=26
height=26
Font=宋体,9,bold

[PushButton Btn6]
Command=EEV_ToolOnControl 6
ImageList=RBMP.EDITEVENTSSIGNALTAB20|RBMP.EDITEVENTSSIGNALTAB20|RBMP.EDITEVENTSSIGNALTAB_DISABLE20|
Help=显示信号和事件表是如何关联的
x=135
y=5
width=26
height=26
Font=宋体,9,bold

[PushButton Btn7]
Command=EEV_ToolOnControl 3
ImageList=RBMP.EDITEVENTSEXIT20|RBMP.EDITEVENTSEXIT20|RBMP.EDITEVENTSEXIT_DISABLE20|
Help=退出正在编辑的积分事件
x=161
y=5
width=26
height=26
Font=宋体,9,bold

[PushButton Btn8]
Command=EEV_ToolOnControl 10
ImageList=RBMP.EDITEVENTSHELP20|RBMP.EDITEVENTSHELP20|RBMP.EDITEVENTSHELP_DISABLE20|
Help=获取帮助
x=187
y=5
width=26
height=26
Font=宋体,9,bold
